rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
genericGD32F103C.menu.upload_method.serialMethod=Serial
genericGD32F103C.menu.upload_method.serialMethod.upload.protocol=maple_serial
genericGD32F103C.menu.upload_method.serialMethod.upload.tool=serial_upload


genericGD32F103C.menu.upload_method.STLinkMethod=STLink
genericGD32F103C.menu.upload_method.STLinkMethod.upload.protocol=STLink
genericGD32F103C.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
genericGD32F103C.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DUSB_HARDWARE -DGENERIC_BOOTLOADER


genericGD32F103C.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
genericGD32F103C.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
genericGD32F103C.menu.upload_method.BMPMethod.upload.tool=bmp_upload
genericGD32F103C.menu.upload_method.BMPMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG

genericGD32F103C.menu.cpu_speed.speed_120mhz=120Mhz (overdrive)
genericGD32F103C.menu.cpu_speed.speed_120mhz.build.f_cpu=120000000L

genericGD32F103C.menu.cpu_speed.speed_96mhz=96Mhz (Stable)
genericGD32F103C.menu.cpu_speed.speed_96mhz.build.f_cpu=96000000L

genericGD32F103C.menu.cpu_speed.speed_72mhz=72Mhz (compatibility)
genericGD32F103C.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

#--USB
genericGD32F103C.menu.usb.serial=Serial
genericGD32F103C.menu.usb.serial.build.usbtype=USB_SERIAL
genericGD32F103C.menu.usb.hid_kmj=Keyboard + Mouse + Joystick
genericGD32F103C.menu.usb.hid_kmj.build.usbtype=USB_HID_KMJ
genericGD32F103C.menu.usb.hid_km=Keyboard + Mouse
genericGD32F103C.menu.usb.hid_km.build.usbtype=USB_HID_KM
genericGD32F103C.menu.usb.hid_j=Joystick
genericGD32F103C.menu.usb.hid_j.build.usbtype=USB_HID_J
genericGD32F103C.menu.usb.midi=MIDI
genericGD32F103C.menu.usb.midi.build.usbtype=USB_MIDI